# ReportsFolder Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..ReportsFolder Property
EnergyDataSettings Class See Also
---
The folder path where all systems analysis reports are stored. It may include special label and relative path.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string ReportsFolder { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ReportsFolder As String
	Get
```

Visual C++
---
```text
public:
property String^ ReportsFolder {
	String^ get ();
}
```

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace